

const images = ["gif6.gif", "gif5.gif", "gif4.gif", "gif3.gif", "gif2.gif"];
const texts = [
    "ขอบคุณน้าาอ้วน เค้าก็รักอ้วนน้า ヾ(≧▽≦*)o ❤️❤️❤️",
    "หึหึหึ ฉันรู้อยู่ละว่าเธอน่ะชอบฉัน! (～￣▽￣)～ ❤️❤️❤️",
    "ว๊าาา วันนี้ยิ้มทั้งวันแน่เลยเค้า! (≧∇≦)ﾉ ❤️❤️",
    "เหมือนมีผีเสื้อบินในท้องเลยอ่าอ้วนน... (✿◠‿◠) 🦋🦋🦋",
    "ว๊าห๊าา ผมก็ชอบคุณเหมือนกันเว้ยย!!!!!( •̀ ω •́ )✧"
];

const randomIndex = Math.floor(Math.random() * images.length);
const randomImage = images[randomIndex];
const randomText = texts[randomIndex];

document.getElementById("randomImage").src = "img/" + randomImage;

document.getElementById("randomText").innerText = randomText;


